back-end/app/controllers/attacks_controller.rb

    def index
        attacks = Attack.all
---
SELECT "attacks".* FROM "attacks"