back-end/app/controllers/battle_stages_controller.rb

    def index
        battles_stages = BattleStage.all
---
SELECT "battle_stages".* FROM "battle_stages"