back-end/app/controllers/enemies_controller.rb

SELECT "enemies".* FROM "enemies"
---
    def index
        enemy = Enemy.all

SELECT "enemies".* FROM "enemies" WHERE "enemies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        enemy = Enemy.find(params[:id])