back-end/app/controllers/games_controller.rb

    def create
        game = Game.create(player_name: params["name"], score: params["score"])
---
INSERT INTO "games" ("player_name", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["player_name", "GC3"], ["score", 600], ["created_at", "2020-04-13 22:53:06.608516"], ["updated_at", "2020-04-13 22:53:06.608516"]]