back-end/app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros"
---
    def index
        hero = Hero.all

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        hero = Hero.find(params[:id])